test/request-response-samples/GetNodes__complex_self_referencing/request.xml

<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"  xmlns:tns="http://tempuri.org/"><SOAP-ENV:Body><tns:GetNodes xmlns:tns="http://tempuri.org/" xmlns="http://tempuri.org/"></tns:GetNodes></SOAP-ENV:Body></SOAP-ENV:Envelope>